; domain
(define (domain rover-minerales)
  (:requirements :typing :negative-preconditions)

  (:types
    localidad mineral rover - object
  )

  (:predicates
    (en-rover ?r - rover ?l - localidad)        ; el rover está en localidad l
    (en-mineral ?m - mineral ?l - localidad)    ; el mineral m está en localidad l
    (transportando ?r - rover ?m - mineral)     ; el rover lleva el mineral m
    (laboratorio ?l - localidad)                ; localidad l tiene laboratorio
    (analizado ?m - mineral)                    ; el mineral m ya fue analizado
    (camino ?l1 - localidad ?l2 - localidad)    ; existe camino de l1 a l2
    (manos-libres ?r - rover)                   ; el rover no carga nada
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Mover el rover de una localidad a otra
  ; ------------------------------------------------------------------
  (:action mover
    :parameters (?r - rover ?desde - localidad ?hacia - localidad)
    :precondition (and
      (en-rover ?r ?desde)
      (camino ?desde ?hacia)
    )
    :effect (and
      (not (en-rover ?r ?desde))
      (en-rover ?r ?hacia)
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Recoger un mineral en la localidad donde está el rover
  ; ------------------------------------------------------------------
  (:action recoger
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (en-mineral ?m ?l)
      (manos-libres ?r)
    )
    :effect (and
      (transportando ?r ?m)
      (not (en-mineral ?m ?l))
      (not (manos-libres ?r))
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Entregar mineral en el laboratorio
  ; ------------------------------------------------------------------
  (:action entregar
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (transportando ?r ?m)
      (laboratorio ?l)
    )
    :effect (and
      (not (transportando ?r ?m))
      (manos-libres ?r)
      (analizado ?m)
    )
  )
)

; problem
(define (problem rover-problema1)
  (:domain rover-minerales)

  (:objects
    rover1 - rover
    loc1 loc2 loc3 loc4 loc5 - localidad
    mineral1 mineral2 - mineral
  )

  (:init
    ; Posición inicial del rover
    (en-rover rover1 loc3)
    (manos-libres rover1)

    ; Minerales excavados
    (en-mineral mineral1 loc1)
    (en-mineral mineral2 loc2)

    ; Laboratorio
    (laboratorio loc5)

    ; Red de caminos
    ;   loc3 <-> loc1  (bidireccional)
    (camino loc3 loc1)
    (camino loc1 loc3)
    ;   loc3 -> loc2   (una dirección)
    (camino loc3 loc2)
    ;   loc2 -> loc4   (una dirección)
    (camino loc2 loc4)
    ;   loc3 <-> loc4  (bidireccional)
    (camino loc3 loc4)
    (camino loc4 loc3)
    ;   loc4 <-> loc5  (bidireccional)
    (camino loc4 loc5)
    (camino loc5 loc4)
  )

  (:goal
    (and
      (analizado mineral1)
      (analizado mineral2)
    )
  )
)

; plan
1. (mover rover1 loc3 loc1)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc1)
   goals met: 0 of 2
2. (recoger rover1 mineral1 loc1)
   deleted: (en-mineral mineral1 loc1) (manos-libres rover1)
   added: (transportando rover1 mineral1)
   goals met: 0 of 2
3. (mover rover1 loc1 loc3)
   deleted: (en-rover rover1 loc1)
   added: (en-rover rover1 loc3)
   goals met: 0 of 2
4. (mover rover1 loc3 loc4)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc4)
   goals met: 0 of 2
5. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 0 of 2
6. (entregar rover1 mineral1 loc5)
   deleted: (transportando rover1 mineral1)
   added: (manos-libres rover1) (analizado mineral1)
   goals met: 1 of 2
7. (mover rover1 loc5 loc4)
   deleted: (en-rover rover1 loc5)
   added: (en-rover rover1 loc4)
   goals met: 1 of 2
8. (mover rover1 loc4 loc3)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc3)
   goals met: 1 of 2
9. (mover rover1 loc3 loc2)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc2)
   goals met: 1 of 2
10. (recoger rover1 mineral2 loc2)
   deleted: (en-mineral mineral2 loc2) (manos-libres rover1)
   added: (transportando rover1 mineral2)
   goals met: 1 of 2
11. (mover rover1 loc2 loc4)
   deleted: (en-rover rover1 loc2)
   added: (en-rover rover1 loc4)
   goals met: 1 of 2
12. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 1 of 2
13. (entregar rover1 mineral2 loc5)
   deleted: (transportando rover1 mineral2)
   added: (manos-libres rover1) (analizado mineral2)
   goals met: 2 of 2
